{
  "basics": {
    "name": "Leonardo Pepino",
    "label": "PhD Candidate",
    "image": "",
    "email": "lpepino@dc.uba.ar",
    "summary": "PhD student at University of Buenos Aires performing research at the intersection of deep learning and audio."
  },
  "work": [
    {
      "name": "Google LLC",
      "position": "Research Intern",
      "startDate": "2024-07",
      "endDate": "2024-10",
      "summary": "3 months internship at NYC offices. I experimented with novel Neural Audio Codec architectures and its applications to speech LLMs and speech synthesis.",
      "highlights": ["Neural Audio Codecs", "Speech LLM", "Representation Learning"]
    },
    {
      "name": "ASAPP Inc.",
      "position": "Research Intern",
      "startDate": "2024-04",
      "endDate": "2024-07",
      "summary": "3 months remote internship. I trained speech and audio LLMs from scratch and incorporated novel audio encoding approaches.",
      "highlights": ["Speech LLM", "Audio LLM", "Instruction Fine-tuning", "PEFT", "Audio encoders"]
    },
    {
      "name": "Brno University of Technology",
      "position": "Research Intern",
      "startDate": "2023-05",
      "endDate": "2023-08",
      "summary": "3 months internship in Brno, Czech Republic. I worked in the Chime Challenge for multi-channel, multi-speaker ASR.",
      "highlights": ["ASR", "CHiME", "RNN-T", "Transfer Learning"]
    },    
    {
      "name": "Google LLC",
      "position": "Student Researcher",
      "startDate": "2022-09",
      "endDate": "2022-12",
      "summary": "3 months internship at Mountain View offices. I experimented with novel audio language modelling techniques for generation of long and coherent speech.",
      "highlights": ["AudioLM", "Textless NLP", "Long context"]
    },
    {
      "name": "Hipcam",
      "position": "Research Intern",
      "startDate": "2021",
      "endDate": "2022",
      "summary": "Part-time internship. I collaborated with the design and development of wake-word detection models using deep learning, and participated in the development of a complete machine learning pipeline, from data preprocessing to model deployment in intelligent surveillance systems.",
      "highlights": ["Wakeword detection", "Embedded systems"]
    }
  ],
  "education": [
    {
      "institution": "Universidad de Buenos Aires",
      "location": "Buenos Aires, Argentina",
      "area": "My project is titled ”New deep learning strategies for general sound understanding” and is supervised by Dr. Luciana Ferrer and co-supervised by Dr. Pablo Riera. This research focuses on developing reusable deep learning models for general-purpose audio understanding, with an emphasis on transfer learning in low-resource scenarios. The project explores the adaptation of transformer architectures to audio signal processing and investigates various self-supervised pretraining strategies to enhance model generalization across diverse audio tasks.",
      "studyType": "PhD in Computer Science",
      "startDate": "2020",
      "endDate": "2025"
    },
    {
      "institution": "Universidad de Tres de Febrero",
      "location": "Caseros, Argentina",
      "area": "This integrated engineering degree is equivalent to a combined Bachelor's and Master's program (4 + 2 years). It includes a final project comparable to a Master's thesis. My thesis, titled ”Music Source Separation Using Convolutional Neural Networks”, was supervised by Dr. Laurence Bender. GPA: 8.07/10.",
      "studyType": "Dipl. Sound Engineering",
      "startDate": "2013",
      "endDate": "2019"
    }
  ],
  "publications": [
    {
      "name": "Leveraging Pre-Trained Autoencoders for Interpretable Prototype Learning of Music Audio",
      "publisher": "ICASSP 2024 Workshop on Explainable AI for Speech and Audio",
      "releaseDate": "2024",
      "url": "https://arxiv.org/abs/2402.09318"
    },
    {
      "name": "Phone and speaker spatial organization in self-supervised speech representations",
      "publisher": "ICASSP 2023",
      "releaseDate": "2023",
      "url": "https://arxiv.org/abs/2302.14055"
    },
    {
      "name": "Study of positional encoding approaches for Audio Spectrogram Transformers",
      "publisher": "ICASSP 2022",
      "releaseDate": "2022",
      "url": "https://arxiv.org/abs/2110.06999"
    },
    {
      "name": "Emotion Recognition from Speech Using Wav2vec 2.0 Embeddings",
      "publisher": "Interspeech 2021",
      "releaseDate": "2021",
      "url": "https://arxiv.org/abs/2104.03502"
    },
    {
      "name": "Alzheimer Disease Recognition Using Speech-Based Embeddings From Pre-Trained Models.",
      "publisher": "Interspeech 2021",
      "releaseDate": "2021",
      "url": "https://www.isca-archive.org/interspeech_2021/gauder21_interspeech.html"
    },
    {
      "name": "Fusion approaches for emotion recognition from speech using acoustic and text-based features.",
      "publisher": "ICASSP 2020",
      "releaseDate": "2020",
      "url": "https://arxiv.org/abs/2403.18635"
    }   
  ]
}
